Autodesk.Navisworks.Api.Data.NavisworksCommand
Implementation of DbCommand.

Autodesk.Navisworks.Api.Data.NavisworksCommand.#ctor
Default constructor

Autodesk.Navisworks.Api.Data.NavisworksCommand.#ctor(Autodesk.Navisworks.Api.Data.NavisworksConnection)
Initializes the command and associates it with the specified connection.
connection: The connection to associate with the command

Autodesk.Navisworks.Api.Data.NavisworksCommand.#ctor(System.String)
Initializes the command with the given command text
commandText: The SQL command text

Autodesk.Navisworks.Api.Data.NavisworksCommand.#ctor(System.String,Autodesk.Navisworks.Api.Data.NavisworksConnection)
Initializes the command with the given SQL command text and attach the command to the specified
connection.
commandText: The SQL command text
connection: The connection to associate with the command

Autodesk.Navisworks.Api.Data.NavisworksCommand.Cancel
Not implemented

Autodesk.Navisworks.Api.Data.NavisworksCommand.CommandText
The SQL command text associated with the command

Autodesk.Navisworks.Api.Data.NavisworksCommand.CommandTimeout
Not implement

Autodesk.Navisworks.Api.Data.NavisworksCommand.CommandType
The type of the command. NavisworksCommand only supports CommandType.Text

Autodesk.Navisworks.Api.Data.NavisworksCommand.Connection
The connection associated with this command

Autodesk.Navisworks.Api.Data.NavisworksCommand.CreateDbParameter
Forwards to the local CreateParameter() function
Returns: Returns a NavisWorksDataReader object

Autodesk.Navisworks.Api.Data.NavisworksCommand.CreateParameter
Create a new parameter.
Returns:
Return NavisworksParameter

Autodesk.Navisworks.Api.Data.NavisworksCommand.DbConnection
Forwards to the local Connection property

Autodesk.Navisworks.Api.Data.NavisworksCommand.DbParameterCollection
Forwards to the local Parameters property

Autodesk.Navisworks.Api.Data.NavisworksCommand.DbTransaction
Not implement

Autodesk.Navisworks.Api.Data.NavisworksCommand.DesignTimeVisible
Not implement

Autodesk.Navisworks.Api.Data.NavisworksCommand.Dispose(System.Boolean)


Autodesk.Navisworks.Api.Data.NavisworksCommand.ExecuteDbDataReader(System.Data.CommandBehavior)
Creates a new NavisWorksDataReader to execute/iterate the array of prepared statements
behavior: The behavior the data reader should adopt
Returns: Returns a NavisWorksDataReader object

Autodesk.Navisworks.Api.Data.NavisworksCommand.ExecuteNonQuery
Execute the command and return the number of rows inserted/updated affected by it.
Returns: The number of rows inserted/updated affected by this executed command
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.Data.NavisworksCommand.ExecuteReader
Overrides the default behavior of DbDataReader to return a specialized NavisWorksDataReader class
Returns:
Return NavisWorksDataReader
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.Data.NavisworksCommand.ExecuteReader(System.Data.CommandBehavior)
Overrides the default behavior to return a NavisWorksDataReader specialization class
behavior: The flags to be associated with the reader
Returns:
Return NavisWorksDataReader
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.Data.NavisworksCommand.ExecuteScalar
Execute the command and return the first column of the first row of the resultset
(if present), or null if no resultset was returned.
Returns: The first column of the first row of the first resultset from the query
Throws Autodesk.Navisworks.Api.Data.DatabaseException:
Database exception

Autodesk.Navisworks.Api.Data.NavisworksCommand.Parameters
Not implement, will implement
Returns the NavisworksParameterCollection for this command

Autodesk.Navisworks.Api.Data.NavisworksCommand.Prepare
Does nothing.  Commands are prepared as they are executed the first time, and kept in prepared state afterwards.

Autodesk.Navisworks.Api.Data.NavisworksCommand.UpdatedRowSource
Not implement